const celebrate = [
  {
    'indexOfMonth': 0,
    'days': [
      {
        'number': 15,
        'title': 'Ночь без сна',
        'conditions': [
          'Не спать всю ночь при любых условиях'
        ],
        'exeptions': [
          'Если сон спасет мою жизнь',
          'Если сон спасет жизнь другого человека',
          'Если меня могут уволить или избить',
          'Если в этот вечер встреча с Мией Васиковска'
        ],
        'history': 'Без предыстории',
        'year': 2017
      }
    ]
  },
  {
    'indexOfMonth': 1,
    'days': [
      {
        'number': 14,
        'title': 'День курения',
        'conditions': [
          'Попробовать 3 разных марок сигарет, из разных ценовых категорий: до 2-ух рублей, до 5-и рублей, около 10 рублей'
        ],
        'exeptions': [
          'Если накануне сгорело помещение, где я живу',
          'Если как по волшебству, исчезли все деньги'
        ],
        'history': 'Начал курить в феврале 2017 года',
        'year': 2017
      }
    ]
  },
  {
    'indexOfMonth': 2,
    'days': [
      {
        'number': 4,
        'title': 'Оскар',
        'conditions': [
          'Смотреть церемонию награждения "Оскар" не менее 3-ех часов'
        ],
        'exeptions': [
          'Смерть, угроза жизни',
          'Если это негативно может повлиять на отношения с другим человеком',
          'Если, в качестве ведущего будет Фассбендер или актер, который находить в моем списке 99 клоунов'
        ],
        'history': 'Начал смотреть оскар с 2015 года, наблюдать за результатами с 2010',
        'year': 2015
      },
      {
        'number': 8,
        'title': 'День Меддисона',
        'conditions': [
          'Смотреть меддисона не менее 4-ех часов',
          'Выпить 2 литра пива "Жигулевское"',
          'Вспоминать воспоминания из прошлого, связанные с ним'
        ],
        'exeptions': [
          'Если я разочаруюсь в старине Меде',
          'Если интернет будет отключен во всем мире'
        ],
        'history': 'Начал смотреть с 2010 года. Поначалу, мне он не понравился, но, вскоре, я стал его считать одним из самых интересных и любопытных личностей в мире',
        'year': 2017
      }
    ]
  },
  {
    'indexOfMonth': 3,
    'days': [
      {
        'number': 16,
        'title': 'День свиданий',
        'conditions': [
          'Если есть женщина, сводить сходить с ней в бар/ресторан/кафе',
          'Если женщины нет, пойти на свидание с незнакомым, или знакомым человеком, при условии, что со вторым ты не общался больше 3-ех месяцев'
        ],
        'exeptions': [
          'Если я физически не смогу ходить/видеть',
          'Если моя внешность окажется крайне уродливой, как в фильме "Ванильное небо"'
        ],
        'history': 'Начало весны - всегда время романтики. Обычно, именно весной я желаю новых знакомств. Пример, начало 2014 года, первый курс, общение с Настей, Вероникой и др',
        'year': 2017
      }
    ]
  },
  {
    'indexOfMonth': 4,
    'days': [
      {
        'number': 2,
        'title': 'ДР',
        'conditions': [
          'Выпить чего-нибудь крепкого',
          'Вспомнить что-нибудь хорошее, связанное с этим днем'
        ],
        'exeptions': [
          'Смерть/угроза жизни'
        ],
        'history': 'Да, какая здесь может быть история. Никогда не праздную, но, праздник есть праздник',
        'year': 2017
      },
      {
        'number': 6,
        'title': 'День гавайских рубашек',
        'conditions': [
          'Ходить весь день в гавайской рубашке красных оттенков'
        ],
        'exeptions': [
          'Если нужно идти на похороны/суд/любое очень и очень отвественное мероприятие'
        ],
        'history': 'Вдохновлено игрой Far Cry, которая связана у меня с маем. Без предыстории',
        'year': 2017
      },
      {
        'number': 8,
        'title': 'День Oblivion',
        'conditions': [
          'Играть не менее 5-и часов в The Elder Scrolls: Oblivion'
        ],
        'exeptions': [
          'Если не будет доступа к личному компьютеру'
        ],
        'history': 'В 2008 году, когда я купил на рынке диск с этой игрой, я был просто поражен, впервые включив эту игру. Мой отец заставил меня выбивать ковер, когда я шлялся в тюремных подземельях. Я был просто поражен, когда впервые вышел из пещер на островную локацию и увидел руины. Это было детское потрясение, которое навечно связано с этой игрой. Я читал перед первым прохождением об игре в журнале "Каламбур" и "Один дома" еще с момента её выхода, я лелеял скриншоты, которые были обупликованы в них. Все лето 2008, когда родилась моя сестра, я играл в эту игру. Когда моя сестра родилась, мой отец бухал с другом и пошел к соседям, а я пошел к соседу Паше и учил играть его в Обливио до самого конца. Это были очень приятные воспоминания.  ',
        'year': 2017
      },
      {
        'number': 13,
        'title': 'Евровидиние',
        'conditions': [
          'Читать комментарии на 2ch и смотреть всю трансляцию финала евровидения'
        ],
        'exeptions': [
          'В случае дедлайна на работе'
        ],
        'history': 'В 2017 году, один из самых счастливых и веселых дней, был днем просмотра Евровидения, когда в общежитии на Томина я был один, и весь вечер ухахатывался с остроумных комминтариев посетителей 2ча, влюблялся в представительницу от Грузии и с наслаждением слушал песню "I Cant go on" от представителя Швеции.',
        'year': 2017
      },
      {
        'number': 15,
        'title': 'День начала программирования',
        'conditions': [
          'Выпить какой-нибудь коктейль или чего-нибудь крепкого',
          'Вспомнить создание своего первого сайта на юкоз',
          'Просмотреть фильм "Почему он?"'
        ],
        'exeptions': [
          'Смерть/угроза жизни'
        ],
        'history': 'Начал заниматься програмиированием в середине мая 20017 года, после того, как получил печальный опыт предыдущей работы, начал жить с программистом, и, самое весомое, посмотрел довольно глупый, но все же чего-то стоящий фильм с Браяном Кренстоном "Почему он?". После этого фильма я все чаще начал думать об идее стать программистом, что, в конце концов и исполнилось.',
        'year': 2017
      },
      {
        'number': 29,
        'title': 'День Far Cry',
        'conditions': [
          'Поиграть не менее 5-ех часов в игру Far Cry'
        ],
        'exeptions': [
          'Смерть/угроза жизни',
          'Если не будет доступа к личному компьютеру'
        ],
        'history': 'В 2006-7 году, когда я был школьником и меня ждало 3 месяца отвязных каникул, я помню дождливый майский день, когда я завалил английский и вернулся домой. Родители увидели меня без настроения и начали утешать, что это был послдений школьный день перед каникулами. Я словно ожил. Мой отец захотел поиграть в игры, что случается довольно редко, и он сел играть в Фар Край. Я сидел рядом, смотрел в монитор, и радовался, что мой отец - классный чувак. До сих пор помню свою любовь к нему в этот момент. Это было очень очень для меня важно и трогательно, ведь мне было приятно, что у нас есть похожие интересы.',
        'year': 2017
      }
    ]
  },
  {
    'indexOfMonth': 5,
    'days': [
      {
        'number': 1,
        'title': '500 дней лета',
        'conditions': [
          'Посмотреть и подумать о фильме 500 дней лета'
        ],
        'history': 'Впервые посмотрел фильм в 2011 году. Он стал одним из моих любимых. Когда я его впервые посмотрел, я очень сочувствовал главному герою, потому что считал его похожим на себя. Но теперь мое мнение о нем изменилось. Символически, фильм, о расцвете отношений, а романтика, всегда связана с чем-то теплым, и лето, в частности его первый день - идеальное время для начала чего-нибудь хорошего',
        'year': 2017
      },
      {
        'number': 3,
        'title': 'День без интернета',
        'conditions': [
          'В свободное от работы время, вообще не использовать интернет. Исключения: если результат доступа к интренету спасет человеческую жизнь, если нужно выполнить обещание, данное другому человеку, если с человеком нужно срочно связаться, а телефон в этот момент сломан или не работает'
        ],
        'exeptions': [
          'Смерть/угроза жизни'
        ],
        'history': 'Нехуй дома сидеть летом. Пиздуй куда нибудь, никакого интренета в этот день',
        'year': 2017
      },
      {
        'number': 6,
        'title': 'День воспоминаний',
        'conditions': [
          'Перечитывать свой дневник в течение не менее 2-ух часов',
          'Сделать бекап данных'
        ],
        'exeptions': [
          'Если дневник исчезнет'
        ],
        'history': 'С 2013 году, после 11-ого класса, начал вести свой дневник. За это время там появилось бессчисленное количество записей. Это нужно перечитать и обмозговать',
        'year': 2017
      },
      {
        'number': 13,
        'title': 'День треш кино',
        'conditions': [
          'Просмотреть не менее 3-ех треш-фильма'
        ],
        'exeptions': [
          'Смерть/угроза жизни'
        ],
        'history': 'В 2015 году, летом, под конец моей дружбы с Егором, я устроил себе внезапный день треш кино. Тогда еще Вадим был в общаге. Я посмотрел очень плохое, но смешное, иногда отвратительное, но очень запоминающееся кино. Например, по одному из них я затем сделал видео с песней Пласибо. Очень часто возраждаю эту традицию',
        'year': 2015
      }
    ]
  },
  {
    'indexOfMonth': 6,
    'days': [
      {
        'number': 4,
        'title': 'День матери',
        'conditions': [
          'Сделать купить маме достойный подарок',
          'Вспомнить о воспоминаниях связанных с ней',
          'Выпить'
        ],
        'exeptions': [
          'Смерть/угроза жизни'
        ],
        'history': 'День Рождения мамы, такое упускать нельзя',
        'year': 2003
      },
      {
        'number': 13,
        'title': 'День отелей',
        'conditions': [
          'Провести ночь в отеле'
        ],
        'exeptions': [
          'Смерть/угроза жизни',
          'Количество денег менее 1000 рублей'
        ],
        'history': 'Люблю фильм 1908. Без предыстории',
        'year': 2017
      },
      {
        'number': 29,
        'title': 'День отказа от еды',
        'conditions': [
          'Абсолютно ничего не есть из пищи',
          'Читать книгу в любом формате'
        ],
        'exeptions': [
          'Смерть/угроза жизни',
          'Если в гостях у родителей девушки'
        ],
        'history': 'В 2014, в конце июля, я сел на самую жескую диету в своей жизни. Ничего не ел, только лежал, читал Гарри Поттера. Было плохо, но мне это очень запомнилось',
        'year': 2017
      }
    ]
  },
  {
    'indexOfMonth': 7,
    'days': [
      {
        'number': 10,
        'title': 'День пьянства на работе',
        'conditions': [
          'Выпить не менее 1-ого литра пива / не менее 0.5 вина / не менее 300 водки, нахлдясь на территории работадателя'
        ],
        'exeptions': [
          'Смерть/угроза жизни',
          'Дедлайн'
        ],
        'history': 'Лето - время приключений и бухла. Без предыстории',
        'year': 2017
      },
      {
        'number': 30,
        'title': 'День любви',
        'conditions': [
          'Выпить',
          'Вспонить об объектах собственной влюбленности'
        ],
        'exeptions': [
          'Смерть/угроза жизни'
        ],
        'history': 'Я впервые встретил Александру в конце августа 2014. Это было самое сильно чувство за долгое время.',
        'year': 2017
      }
    ]
  },
  {
    'indexOfMonth': 8,
    'days': [
      {
        'number': 6,
        'title': 'Неделя пива',
        'conditions': [
          'На протяжении каждого дня последующих 7-и дней, начинающегося с 6-ого сентября, выпивать не менее 1.5 литра любого пива'
        ],
        'exeptions': [
          'Смерть/угроза жизни'
        ],
        'history': 'В сетрябре 2014 была добрая традиция, после университета идти с соедями по общежитию и покупать пиво. Затем позвращаться и бухать',
        'year': 2014
      },
      {
        'number': 14,
        'title': 'День Fable',
        'conditions': [
          'Играть в Fable не менее 5-и часов'
        ],
        'exeptions': [
          'Смерть/угроза жизни'
        ],
        'history': 'В 2006 году у двоюродного брата Вани, я взял диск с этой игрой. Я вскоре приехал с Украины с отцом домой, и однажды вечером, когда я был только с отцом, я решил поиграть в эту игру. Это было откровение на всю жизнь. Одна из самых любимых игр. Приурочена к дате выхода игры',
        'year': 2006
      },
      {
        'number': 30,
        'title': 'Монолит',
        'conditions': [
          'Писать "Монолит"'
        ],
        'exeptions': [
          'Смерть/угроза жизни',
          'Исчезновение дневника и его бекапов'
        ],
        'history': 'Начал писать в 2014 году, каждый год отвечаю на одинаковые вопросы и прослеживаю изменения собственного отношения к ним. По традиции, последний день сентября',
        'year': 2014
      }
    ]
  },
  {
    'indexOfMonth': 9,
    'days': [
      {
        'number': 14,
        'title': 'Отцовский день',
        'conditions': [
          'Сделать купить папе достойный подарок',
          'Вспомнить о воспоминаниях связанных с ним',
          'Выпить'
        ],
        'exeptions': [
          'Смерть/угроза жизни'
        ],
        'history': 'День Рождения папы, такое упускать нельзя',
        'year': 2003
      }
    ]
  },
  {
    'indexOfMonth': 10,
    'days': [
      {
        'number': 10,
        'title': 'День Fallout 4',
        'conditions': [
          'Играть в Fallout 4 не менее 2-ух часов',
          'Бухать'
        ],
        'exeptions': [
          'Смерть/угроза жизни',
          'Отсуствие личного компьютера'
        ],
        'history': 'В 2015 году, одним из самых ожидаемых событий - был день выхода Fallout 4. Помню, как возвращался побыстрее с университета, чтобы в неё поиграть',
        'year': 2003
      },
      {
        'number': 11,
        'title': 'День Скайрима',
        'conditions': [
          'Играть в The Elder Scrolls 4: Skyrim не менее 4-ех часов',
          'Бухать',
          'Посмотреть обзор на скайрим от игрооргий'
        ],
        'exeptions': [
          'Смерть/угроза жизни',
          'Отсуствие личного компьютера'
        ],
        'history': 'В 2011 году, впервые в неё поиграл, на компьютере, где даже карта локаций не подгружалась процессором. Провел в игре в совокупности более 300-от часов. Очень много приятных воспоминаний',
        'year': 2011
      },
      {
        'number': 20,
        'title': 'День Black Mirror',
        'conditions': [
          'Просмотреть не менее 4-ех эпизодов "Черного зеркала"'
        ],
        'exeptions': [
          'Смерть/угроза жизни',
          'Отсуствие личного компьютера'
        ],
        'history': 'В 2015 впервые посмотрел сериал. Теперь он самый любимый',
        'year': 2015
      },
      {
        'number': 24,
        'title': 'День Mafia 2',
        'conditions': [
          'Поиграть в Mafia 2 не мене 4-ех часов'
        ],
        'exeptions': [
          'Смерть/угроза жизни',
          'Отсуствие личного компьютера'
        ],
        'history': 'С 2012 года, после того как её посоветовал Саша - одноклассник, одна из любимых игр',
        'year': 2012
      }
    ]
  },
  {
    'indexOfMonth': 11,
    'days': [
      {
        'number': 28,
        'title': 'День Max Payne',
        'conditions': [
          'Поиграть в первую часть Max Payne не менее 4-ех часов'
        ],
        'exeptions': [
          'Смерть/угроза жизни',
          'Отсуствие личного компьютера'
        ],
        'history': 'С 2013 года, когда впервые сыграл, мою любовь к ней подкреплялась традицией меда играть в неё перед новым годом. Мне понравилась традиция и я ешил её перенять',
        'year': 2013,
        'feedback':
            {
              '2017': 'Поиграл 4 часа. Было сложно уседеть, получил не очень много эмоций, но потом, спустя какое-то время приобщился.'
            }
      },
      {
        'number': 29,
        'title': 'День Love Actually',
        'conditions': [
          'Поcмотреть фильм Love Actually'
        ],
        'exeptions': [
          'Смерть/угроза жизни'
        ],
        'history': 'Любимый фильм на Новый Год/Рождество, пересматривал на новый год 2014, когда был дома с семьей',
        'year': 2014,
        'feedback':
            {
              '2017': 'Было очень весело, мне понравилось. Очень понравилось'
            }
      },
      {
        'number': 31,
        'title': 'День подведения итогов',
        'conditions': [
          'Сделать иноговую заметку в дневнике'
        ],
        'exeptions': [
          'Смерть/угроза жизни',
          'Отсутствие интернета'
        ],
        'history': 'Новый Год - время подведения итогов. Всего того, что принесло счастье и останется с тобой навсегда',
        'year': 2017,
        'feedback':
          {
            '2017': 'Немного припознился, но на новый год все прощается. Хреновый год. Мало чего было интересного. Не чувствую себя счастливым.'
          }
      }
    ]
  }
]

export default celebrate
